# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\HPz420\Documents\GitHub\land-boards\lb-boards\FPGA Cards\RETRO-EP4CE15\PSOC\USBFS_UART01\USBFS_UART01.cydsn\USBFS_UART01.cyprj
# Date: Sun, 17 Nov 2019 13:13:28 GMT
#set_units -time ns
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for C:\Users\HPz420\Documents\GitHub\land-boards\lb-boards\FPGA Cards\RETRO-EP4CE15\PSOC\USBFS_UART01\USBFS_UART01.cydsn\TopDesign\PSoC4\PSoC 4200L\TopDesign.cysch
# Project: C:\Users\HPz420\Documents\GitHub\land-boards\lb-boards\FPGA Cards\RETRO-EP4CE15\PSOC\USBFS_UART01\USBFS_UART01.cydsn\USBFS_UART01.cyprj
# Date: Sun, 17 Nov 2019 13:13:24 GMT
